debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/console/us-smoke.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://35.227.198.68.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/us-smoke.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://35.227.198.68.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T110630.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/us-smoke.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T110630.json --env K6_SCENARIO=smoke --env BASE_URL=https://35.227.198.68.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/us-smoke.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T11:06:31Z" level=info msg="\n============================================================" source=console
time="2026-04-10T11:06:31Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T11:06:31Z" level=info msg="Base URL: https://35.227.198.68.nip.io" source=console
time="2026-04-10T11:06:31Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 1 VUs  00.9s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   6% ] 1 VUs  01.9s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  02.9s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  13% ] 1 VUs  03.9s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  16% ] 1 VUs  04.9s/30s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  05.9s/30s

running (0m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  23% ] 1 VUs  06.9s/30s

running (0m08.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  26% ] 1 VUs  07.9s/30s

running (0m09.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  08.9s/30s

running (0m10.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  33% ] 1 VUs  09.9s/30s

running (0m11.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  36% ] 1 VUs  10.9s/30s

running (0m12.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  11.9s/30s

running (0m13.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  43% ] 1 VUs  12.9s/30s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  46% ] 1 VUs  13.9s/30s

running (0m15.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  14.9s/30s

running (0m16.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  53% ] 1 VUs  15.9s/30s

running (0m17.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  56% ] 1 VUs  16.9s/30s

running (0m18.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  17.9s/30s

running (0m19.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  63% ] 1 VUs  18.9s/30s

running (0m20.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  66% ] 1 VUs  19.9s/30s

running (0m21.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  20.9s/30s

running (0m22.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  73% ] 1 VUs  21.9s/30s

running (0m23.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  76% ] 1 VUs  22.9s/30s

running (0m24.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  23.9s/30s

running (0m25.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  83% ] 1 VUs  24.9s/30s

running (0m26.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  86% ] 1 VUs  25.9s/30s

running (0m27.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  26.9s/30s

running (0m28.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  93% ] 1 VUs  27.9s/30s

running (0m29.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  96% ] 1 VUs  28.9s/30s

running (0m30.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  29.9s/30s

running (0m31.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m32.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m33.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s
time="2026-04-10T11:07:04Z" level=info msg="\n============================================================" source=console
time="2026-04-10T11:07:04Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T11:07:04Z" level=info msg="Target: https://35.227.198.68.nip.io" source=console
time="2026-04-10T11:07:04Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T11:07:04Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✓ route: status 200

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ journey: create

       ✓ journey create: status 201/200/409/422
       ✓ journey create: not 5xx (except 503)

     █ health: gateway

       ✓ nginx healthy: status 200

   ✓ auth_success...................: 100.00% ✓ 3        ✗ 0  
   ✓ capacity_check_duration........: avg=292ms    min=233ms    med=292ms    max=351ms    p(90)=339.2ms  p(95)=345.1ms 
     checks.........................: 100.00% ✓ 24       ✗ 0  
     data_received..................: 223 kB  6.7 kB/s
     data_sent......................: 7.5 kB  225 B/s
     group_duration.................: avg=1.47s    min=97.14ms  med=500.79ms max=7.49s    p(90)=4.37s    p(95)=6.47s   
     http_req_blocked...............: avg=725.29µs min=367ns    med=579ns    max=6.92ms   p(90)=1.83ms   p(95)=6.24ms  
     http_req_connecting............: avg=61.14µs  min=0s       med=0s       max=646.28µs p(90)=136.29µs p(95)=483.12µs
   ✗ http_req_duration..............: avg=1.39s    min=96.73ms  med=466.42ms max=7.48s    p(90)=4.06s    p(95)=6.41s   
       { expected_response:true }...: avg=1.39s    min=96.73ms  med=466.42ms max=7.48s    p(90)=4.06s    p(95)=6.41s   
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 18 
     http_req_receiving.............: avg=10.29ms  min=85.02µs  med=162.56µs max=78.84ms  p(90)=25.84ms  p(95)=34.56ms 
     http_req_sending...............: avg=132.21µs min=76.02µs  med=123.46µs max=237.25µs p(90)=187.6µs  p(95)=234.7µs 
     http_req_tls_handshaking.......: avg=582.65µs min=0s       med=0s       max=5.26ms   p(90)=1.56ms   p(95)=5.22ms  
     http_req_waiting...............: avg=1.38s    min=96.52ms  med=447.68ms max=7.48s    p(90)=4.04s    p(95)=6.41s   
     http_reqs......................: 18      0.541576/s
     iteration_duration.............: avg=6.64s    min=182.82µs med=1.06s    max=17.95s   p(90)=16.41s   p(95)=17.18s  
     iterations.....................: 3       0.090263/s
   ✗ journey_create_success.........: 0.00%   ✓ 0        ✗ 2  
   ✗ route_compute_duration.........: avg=2.54s    min=1.94s    med=2.54s    max=3.14s    p(90)=3.02s    p(95)=3.08s   
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m33.2s), 0/1 VUs, 3 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s
time="2026-04-10T11:07:04Z" level=error msg="thresholds on metrics 'http_req_duration, journey_create_success, route_compute_duration' have been crossed"